Rottenpotatoes/rottenpotatoes/app/controllers/movies_controller.rb

    end

    @order = @order.to_sym
    @movies = Movie.with_ratings(@ratings_to_show).order(@order == :title ? :title : :release_date)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC